'number' + 3 + 3
//стрінга 'number' до якоі додано число 3, залишається стрінгою 'number3', далі додається до стрінги 'number3' число 3 і в результаті залишається стрінга 'number33';

null + 3
//тип даних null, який інтерпретується як число 0, додано число 3, результат - стає числом 3;

5 && "qwerty"
//число 5 - true, тому перевіряється друге значення, стрінга "qwerty" - true, тому результатом буде друге значення "qwerty";

+'40' + +'2' + "hillel";
//+'40' перетворює стрінгу на число 40, далі додаємо унарне число +'2' ,яке теж перетворюється на число 2, 40+2=42 і додаємо стрінгу 'hillel', результатом конкатенаціі є стрінга "42hillel";

'10' - 5 === 6;
//стрінга '10' оператор -, який перетворює стрінгу '10' на число 10 - число 5 = число 5, далі число 5 перевіряється за значенням і у результаті не дорівнює 6, отже результат false;

true + false
//булеве значення true перетворюється у число 1 + булеве значення false перетворюється у число 0, в результаті 1+0= число 1;

'4px' - 3
//стрінгу '4px' JS намагається перетворити на число, але це не число - NaN, далі в резуьтаті NaN -3=NaN;
'4' - 3
//стрінгу '4' JS перетворює на число 4, далі число 4 - число 3 = число 1, результат число 1;

'6' + 3 ** 0;
//число 3 підносимо до степеня числа 0, в результаті число 1, далі до стрінгу '6' додаємо конкатенацію стрінгу '1', результат стрінга '61';
12 / '6'
// стрінгу '6' JS перетворює на число 6, далі число 12 / число 6 = результат число 2;
'10' + (5 === 6);
//(5 === 6) оскільки 5 не дорівнює 6, то результат буде false, далі стрінга '10' конкатенація false стаєає в результаті стрінга '10false'
null == ''
//null порівнюємо з стрінгою '',а оскільки null не дорівнює стрінгі '', результат false;
3 ** (9 / 3);
//число 9 / на число 3 = число 3, число 3 підносимо до степеня числа 3 в результаті число 27;
!!'false' == !!'true'
// подвійне логічне заперечення перетворює непорожню стрінгу 'false' і стрінгу 'true' на булеве true, далі true == true, результат true;

0 || '0' && 1
// не порожня стрінга '0' та число 1, обидва є truthy, (результат число 1) , далі 0 || 1, перше truthy повертає число 1, результат число 1;
(+null == false) < 1;
//унарний плюс пертворює null на число 0, числo 0 == false є true, true перетворюється на число 1 при порівнянні з чилом 1, отже резльтат 1 < 1 є результат false;
false && true || true
//спочатку виконується false && true, false – перше falsy, результат false, далі false || true, перше truthy перетворюється в true, в результаті true;
false && (false || true);
// виконуємо false || true, отже - true, далі false && true, в резултаті false ;

(+null == false) < 1 ** 5;
// унарний плюс пертворює null на число 0, числo 0 == false є true, true перетворюється на число 1, далі виконуємо число 1 підносимо степеня числа 5, результат число 1, отже число 1 < число 1 = результат false;